[{"model": "casestudies.casestudy", "pk": 1, "fields": {"title": "The Leafy Bean Case Study", "slug": "the-leaf-bean-case-study", "image": "", "image_url": "https://jessicajuliet.github.io/the-leafy-bean/", "featured": true, "website_url": "https://jessicajuliet.github.io/the-leafy-bean/", "github_url": "https://github.com/JessicaJuliet/the-leafy-bean", "heading": "The Leafy Bean", "case_study_content": "<h3><strong>Background</strong></h3>\r\n\r\n<p>Many local businesses in Ireland were hit hard by the COVID-19 pandemic. New Government restrictions led to shop closures and continued uncertainty for small businesses. As consumers&rsquo; buying habits shift predominantly online, it was&nbsp;more important than ever for small businesses to have a strong online presence during these challenging times.</p>\r\n\r\n<h3><strong>Project</strong></h3>\r\n\r\n<p>The Leafy Bean&#39;s website was created for a small&nbsp;independent coffee shop located in the heart if Blackrock Village in&nbsp;Dublin. The Leafy Bean had&nbsp;a poor online presence and was struggling to reach their customers during the pandemic. They requested a fully responsive website which would&nbsp;allow them to notify their customers of their opening hours in line with government restrictions, and promote their new takeaway coffee service. Furthermore, The Leafy Bean wanted&nbsp;to establish itself as a local provider of the best coffee in Blackrock and provide information about its high quality coffee beans.</p>\r\n\r\n<h3><strong>Result</strong></h3>\r\n\r\n<p>This project resulted in the creation of a fully responsive single page website for the client. It included an About, Contact Us and Find Us section as well as information about the client&#39;s takeaway service and Bean Points loyalty scheme.&nbsp;</p>"}}, {"model": "casestudies.casestudy", "pk": 2, "fields": {"title": "Irish Gold Distillers Case Study", "slug": "irish-gold-distilers-case-study", "image": "", "image_url": "https://jessicajuliet.github.io/irish-gold-distillers/", "featured": true, "website_url": "https://jessicajuliet.github.io/irish-gold-distillers/", "github_url": "https://github.com/JessicaJuliet/irish-gold-distillers", "heading": "Irish Gold Distillers", "case_study_content": "<h3>Background</h3>\r\n\r\n<p>According to The Irish Whiskey Association, whiskey distilleries in Ireland have grown from just four in 2010 to 32 in 2019, demonstrating the scale of Ireland&#39;s Whiskey Renaissance. This growth in the number of whiskey distilleries shows an increased consumer demand for, and interest in,&nbsp;whiskey products in Ireland.&nbsp;</p>\r\n\r\n<h3>Project</h3>\r\n\r\n<p>The client requested an interactive website to house information about whiskey distilleries in Ireland to meet this new found interest from the public. Until this point, there hadn&#39;t been a &#39;one stop website&#39; which housed all the information about whiskey distilleries in Ireland and the client wanted to close that gap.&nbsp;</p>\r\n\r\n<h3>Result</h3>\r\n\r\n<p>The client was provided with a fully responsive and interactive website which showcased all the whiskey distilleries in Ireland and provided end users with an interactive map by which they could search whiskey distilleries by location.</p>"}}, {"model": "casestudies.casestudy", "pk": 3, "fields": {"title": "Meditracker Case Study", "slug": "meditracker-case-study", "image": "", "image_url": "https://meditracker-project.herokuapp.com/", "featured": true, "website_url": "https://meditracker-project.herokuapp.com/", "github_url": "https://github.com/JessicaJuliet/meditracker", "heading": "MediTracker", "case_study_content": "<h3>Background</h3>\r\n\r\n<p>With chronic illness prevalence expected to continue rising, it&#39;s important that patients are able to monitor their condition(s) and provide their medical team with a clear picture of their disease status. Furthermore, the disruptions which COVID-19 has brought to healthcare systems across the globe system makes it easier for new symptoms of disease progression to potentially be missed until a later stage.&nbsp;</p>\r\n\r\n<h3>Project</h3>\r\n\r\n<p>To tackle this problem, our client requested&nbsp;a patient portal application called MediTracker. The purpose of MediTracker was to allow chronic illness patients to take control of their health by keeping logs of their disease symptoms over time. They can demonstrate these logs to their medical team at appointments to provide them with a more accurate account of their disease activity. In addition, these logs help medical professionals to provide better patient care by seeing their disease activity over time.</p>\r\n\r\n<h3>Result</h3>\r\n\r\n<p>This project resulted in the successful creation of a patient portal application for the client. It provided users with the ability to login to access their own private dashboard and medical logs. Furthermore, it provided functionality to&nbsp;request an appointment with their GP.</p>"}}]